In [ ]:
<a href="https://colab.research.google.com/github/joseeden/joeden/blob/master/docs/021-Software-Engineering/021-Jupyter-Notebooks/022-Exploring-NYC-Public-School-Test-Result-Scores/Exploring-NYC-Public-School-Test-Result-Scores.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Exploring NYC Public School Test Result Scores

<center><img src="schoolbus.jpg"></center>

<!-- ![New York City schoolbus](schoolbus.jpg) -->

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

- **Which NYC schools have the best math results?**:  
  
    - Schools with at least 80% of the max math score (â‰¥640).  
    - Save as `best_math_schools` with `school_name` and `average_math`.
    - Sort the results by "average_math" (descending).  

- **What are the top 10 performing schools based on the combined SAT scores?**:  
  
    - Sum math, reading, and writing scores as `total_SAT`.  
    - Save results in a Datafram called `top_10_schools`.
    - Result should contain columns `school_name` and `total_SAT`
    - Sort results by `total_SAT` (descending).  

- **Which single borough has the largest standard deviation in the combined SAT score?**:  

    - Find the borough with the largest standard deviation in `total_SAT`.  
    - Save results in Dataframe called `largest_std_dev`, with columns:  
      - `borough` (name)  
      - `num_schools` (number of schools in the borough)  
      - `average_SAT` (mean of `total_SAT`)  
      - `std_SAT` (standard deviation of `total_SAT`)  
    - Round all numbers to two decimal places.

In [1]:
import pandas as pd

url = 'https://raw.githubusercontent.com/joseeden/joeden/refs/heads/master/docs/021-Software-Engineering/021-Jupyter-Notebooks/022-Exploring-NYC-Public-School-Test-Result-Scores/schools.csv'  

schools = pd.read_csv(url)
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

## Which NYC schools have the best math results?

Start with creating the Dataframe and displaying the specific columns.

In [ ]:
best_math_scores = (
    schools[["school_name", "average_math"]]
)

best_math_scores

                                           school_name  average_math
0    New Explorations into Science, Technology and ...           657
1                                 Essex Street Academy           395
2                         Lower Manhattan Arts Academy           418
3      High School for Dual Language and Asian Studies           613
4        Henry Street School for International Studies           410
..                                                 ...           ...
370  Queens High School for Information, Research, ...           372
371  Rockaway Park High School for Environmental Su...           357
372                   Channel View School for Research           427
373                    Rockaway Collegiate High School           399
374                                  Scholars' Academy           588

[375 rows x 2 columns]

Next, sort the `average_math` in descending order.

In [ ]:
best_math_scores = (
    schools[["school_name", "average_math"]]
    .sort_values("average_math", ascending=False)
)

best_math_scores

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
..                                                 ...           ...
337             Pan American International High School           340
234  Dr. Susan S. McKinney Secondary School of the ...           332
242  W. H. Maxwell Career and Technical Education H...           326
247                          Multicultural High School           319
182   Pan American International High School at Monroe           317

[375 rows x 2 columns]

Finally, we need to find the score records that are at least 80% of the **maximum possible score of 800** for math, which means we're looking for math scores that are above 640.

Use the `.loc` attribute to select the `average_math` column and filter for the scores above 640.

In [10]:
best_math_scores = (
    schools[["school_name", "average_math"]]
    .loc[schools.average_math > 640]
    .sort_values("average_math", ascending=False)
)

best_math_scores

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

## What are the top 10 performing schools based on the combined SAT scores?

Breaking it down:

- We need a new Dataframe called `top_10_schools`, and
- It should contain the `school_name` column and a new column called `total_SAT`
- The `total_SAT` should be the sum of the math, reading, and writing scores

In [ ]:
top_10_schools = schools[["school_name"]]
top_10_schools

                                           school_name
0    New Explorations into Science, Technology and ...
1                                 Essex Street Academy
2                         Lower Manhattan Arts Academy
3      High School for Dual Language and Asian Studies
4        Henry Street School for International Studies
..                                                 ...
370  Queens High School for Information, Research, ...
371  Rockaway Park High School for Environmental Su...
372                   Channel View School for Research
373                    Rockaway Collegiate High School
374                                  Scholars' Academy

[375 rows x 1 columns]

Add the new `total_SAT` column to the original `schools` Dataframe.

In [22]:
schools["total_SAT"] = None
top_10_schools = schools[["school_name", "total_SAT"]]

top_10_schools

                                           school_name total_SAT
0    New Explorations into Science, Technology and ...      None
1                                 Essex Street Academy      None
2                         Lower Manhattan Arts Academy      None
3      High School for Dual Language and Asian Studies      None
4        Henry Street School for International Studies      None
..                                                 ...       ...
370  Queens High School for Information, Research, ...      None
371  Rockaway Park High School for Environmental Su...      None
372                   Channel View School for Research      None
373                    Rockaway Collegiate High School      None
374                                  Scholars' Academy      None

[375 rows x 2 columns]

Next, we need to populate the new column. Based on the instruction, the `total_SAT` is the sum of columns for math, reading, and writing scores.

In [23]:
schools["total_SAT"] = schools["average_math"] + schools["average_reading"] + schools["average_writing"]
top_10_schools = schools[["school_name", "total_SAT"]]

top_10_schools

                                           school_name  total_SAT
0    New Explorations into Science, Technology and ...       1859
1                                 Essex Street Academy       1193
2                         Lower Manhattan Arts Academy       1261
3      High School for Dual Language and Asian Studies       1529
4        Henry Street School for International Studies       1197
..                                                 ...        ...
370  Queens High School for Information, Research, ...       1086
371  Rockaway Park High School for Environmental Su...       1114
372                   Channel View School for Research       1280
373                    Rockaway Collegiate High School       1207
374                                  Scholars' Academy       1716

[375 rows x 2 columns]

The three columns can also be summed up horizontally using the `sum` function.

The `axis=1` means sum across columns (horizontally) for each row. This means that for each school (each row), the function adds up the three SAT section scores (average_math, average_reading, average_writing).

In [ ]:
schools["total_SAT"] = (
  schools[["average_math", "average_reading", "average_writing"]]
  .sum(axis=1)
)

top_10_schools = schools[["school_name", "total_SAT"]]

top_10_schools

                                           school_name  total_SAT
0    New Explorations into Science, Technology and ...       1859
1                                 Essex Street Academy       1193
2                         Lower Manhattan Arts Academy       1261
3      High School for Dual Language and Asian Studies       1529
4        Henry Street School for International Studies       1197
..                                                 ...        ...
370  Queens High School for Information, Research, ...       1086
371  Rockaway Park High School for Environmental Su...       1114
372                   Channel View School for Research       1280
373                    Rockaway Collegiate High School       1207
374                                  Scholars' Academy       1716

[375 rows x 2 columns]

Finally, sort the the `total_SAT` column in descending order and print only the top ten.

In [28]:
schools["total_SAT"] = (
  schools[["average_math", "average_reading", "average_writing"]]
  .sum(axis=1)
)

top_10_schools = (
  schools[["school_name", "total_SAT"]]
  .sort_values("total_SAT", ascending=False)
)

top_10_schools.head(10)

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

**Efficient approach**: Instead of sorting the `total_SAT` in descending order and printing out just top 10, we can avoid sorting the entire Dataframe and simply print out the top 10 largest values in the `total_SAT` using `nlargest`.

**Note**: This approach does indeed perform some form of sorting internally, but it is optimized to find the top 10 largest values without fully sorting the entire DataFrame. This is achieved using specialized algorithms that only focus on finding the largest N elements (like a heap-based approach).

In [31]:
schools["total_SAT"] = (
  schools[["average_math", "average_reading", "average_writing"]]
  .sum(axis=1)
)

top_10_schools = (
  schools[["school_name", "total_SAT"]]
  .nlargest(10, "total_SAT")
)

top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
93                 Staten Island Technical High School       2041
170                       Bronx High School of Science       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

## Which single borough has the largest standard deviation in the combined SAT score?

We need a new Dataframe called `largest_std_dev` with the columns:

- `borough`
- `num_schools` (new) - count of schools per borough 
- `average_SAT` (new) -  mean of `total_SAT`
- `std_SAT` (new) - standard deviation of `total_SAT`

Based on this, we can clearly see that `agg` will be useful in getting the values for all new columns.

To start, we can create the Dataframe with just the `borough` column. This is just for testing purposes only, and will be changed later.

In [ ]:
largest_std_dev = (
  schools[["borough"]]
)

largest_std_dev

       borough
0    Manhattan
1    Manhattan
2    Manhattan
3    Manhattan
4    Manhattan
..         ...
370     Queens
371     Queens
372     Queens
373     Queens
374     Queens

[375 rows x 1 columns]

Now we need to group the rows of the `schools Dataframe based on the nuique values of the `borough` column. 

**Note**: This only contains information about how the rows are grouped by the values in the `borough` column, but it does not contain the actual grouped data until we perform an aggregation function.

In [62]:
largest_std_dev = (
  schools.groupby('borough')
) 

largest_std_dev

To actually view the grouped data, we need to apply some kind of aggregation or transformation.

After grouping by borough, specify which column to focus on. Here, we're selecting the `total_SAT` column to perform aggregation on.

Get the count, mean, and standard deviation using `agg`. Make sure to round all values to 2 decimal places using `round`.

In [85]:
largest_std_dev = (
  schools.groupby('borough')['total_SAT']
  .agg(["count", "mean", "std"])
  .round(2)
) 

largest_std_dev

               count     mean     std
borough
Bronx             98  1202.72  150.39
Brooklyn         109  1230.26  154.87
Manhattan         89  1340.13  230.29
Queens            69  1345.48  195.25
Staten Island     10  1439.00  222.30

It's almost complete. Now we just need to rename the columns. We also need to filter it to show the record with the highest standard deviation.

In [110]:
largest_std_dev = (
  schools.groupby('borough')['total_SAT']
  .agg(["count", "mean", "std"])
  .round(2)
  .nlargest(1, "std")
) 

largest_std_dev = largest_std_dev.rename(columns={
  "count": "num_schools",
  "mean": "average_SAT",
  "std": "std_SAT",
})

largest_std_dev

           num_schools  average_SAT  std_SAT
borough
Manhattan           89      1340.13   230.29